In [1]:
import pandas as pd

In [16]:
ls ../../input

mapdata_copyright_openstreetmap_contributors.rds
mapdata_copyright_openstreetmap_contributors.txt
noaa_weather_qclcd_documentation.pdf
sampleSubmission.csv
spray.csv
test.csv
train.csv
weather.csv

In [203]:
weather = pd.read_csv('../../input/weather.csv')
spray = pd.read_csv('../../input/spray.csv')
train = pd.read_csv('../../input/train.csv')
test = pd.read_csv('../../input/test.csv')

In [160]:
def fix_dummies(row):
    if row['CULEX PIPIENS/RESTUANS'] == 1:
        row['CULEX PIPIENS'] = 1
        row['CULEX RESTUANS'] = 1
    return row

### Training Data

In [161]:
train.Date = pd.to_datetime(train.Date, infer_datetime_format=True)
train = train.groupby(['Date', 'Address', 'Species', 'Block', 'Street', 'Trap', 'AddressNumberAndStreet', 'Latitude', 'Longitude', 'AddressAccuracy', 'WnvPresent'])['NumMosquitos'].sum().reset_index()
train = train.drop(['Address', 'Block', 'Street', 'AddressNumberAndStreet'], axis=1)
train.Species = train.Species.astype(str)
train.Trap = train.Trap.astype(str)

In [162]:
## Dummifying species.
train = pd.concat([train, pd.get_dummies(train.Species)], axis=1)

In [163]:
train = train.apply(fix_dummies, axis=1).drop(['CULEX PIPIENS/RESTUANS'], axis=1)

In [164]:
rename_train = {
    'CULEX ERRATICUS': 'ERR',
    'CULEX PIPIENS': 'PIP',
    'CULEX RESTUANS': 'REST',
    'CULEX SALINARIUS': 'SAL',
    'CULEX TARSALIS': 'TARS',
    'CULEX TERRITANS': 'TERR',
    'Latitude': 'Lat',
    'Longitude': 'Long'
}

train = train.rename(index=str, columns=rename_train)

In [165]:
train.head()

,Date,Species,Trap,Lat,Long,AddressAccuracy,WnvPresent,NumMosquitos,ERR,PIP,REST,SAL,TARS,TERR
0,2007-05-29,CULEX PIPIENS/RESTUANS,T048,41.867108,-87.654224,8,0,1,0,1,1,0,0,0
1,2007-05-29,CULEX RESTUANS,T048,41.867108,-87.654224,8,0,2,0,0,1,0,0,0
2,2007-05-29,CULEX RESTUANS,T091,41.862292,-87.648860,8,0,1,0,0,1,0,0,0
3,2007-05-29,CULEX RESTUANS,T049,41.896282,-87.655232,8,0,1,0,0,1,0,0,0
4,2007-05-29,CULEX RESTUANS,T153,41.907645,-87.760886,8,0,1,0,0,1,0,0,0

In [175]:
train.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8610 entries, 0 to 8609
Data columns (total 14 columns):
Date               8610 non-null datetime64[ns]
Species            8610 non-null object
Trap               8610 non-null object
Lat                8610 non-null float64
Long               8610 non-null float64
AddressAccuracy    8610 non-null int64
WnvPresent         8610 non-null int64
NumMosquitos       8610 non-null int64
ERR                8610 non-null int64
PIP                8610 non-null int64
REST               8610 non-null int64
SAL                8610 non-null int64
TARS               8610 non-null int64
TERR               8610 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(9), object(2)
memory usage: 1009.0+ KB

### Testing Data

In [167]:
test.Date = pd.to_datetime(test.Date, infer_datetime_format=True)
test = test.drop(['Address', 'Block', 'Street', 'AddressNumberAndStreet'], axis=1)
test.Species = test.Species.astype(str)
test.Trap = test.Trap.astype(str)

In [168]:
test.head()

,Id,Date,Species,Trap,Latitude,Longitude,AddressAccuracy
0,1,2008-06-11,CULEX PIPIENS/RESTUANS,T002,41.95469,-87.800991,9
1,2,2008-06-11,CULEX RESTUANS,T002,41.95469,-87.800991,9
2,3,2008-06-11,CULEX PIPIENS,T002,41.95469,-87.800991,9
3,4,2008-06-11,CULEX SALINARIUS,T002,41.95469,-87.800991,9
4,5,2008-06-11,CULEX TERRITANS,T002,41.95469,-87.800991,9

In [169]:
## Dummifying species.
test = pd.concat([test, pd.get_dummies(test.Species)], axis=1)

In [170]:
test = test.apply(fix_dummies, axis=1).drop(['CULEX PIPIENS/RESTUANS'], axis=1)

In [171]:
rename_test = {
    'CULEX ERRATICUS': 'ERR',
    'CULEX PIPIENS': 'PIP',
    'CULEX RESTUANS': 'REST',
    'CULEX SALINARIUS': 'SAL',
    'CULEX TARSALIS': 'TARS',
    'CULEX TERRITANS': 'TERR',
    'Latitude': 'Lat',
    'Longitude': 'Long'
}

test = test.rename(index=str, columns=rename_test)

In [172]:
test.head()

,Id,Date,Species,Trap,Lat,Long,AddressAccuracy,ERR,PIP,REST,SAL,TARS,TERR,UNSPECIFIED CULEX
0,1,2008-06-11,CULEX PIPIENS/RESTUANS,T002,41.95469,-87.800991,9,0,1,1,0,0,0,0
1,2,2008-06-11,CULEX RESTUANS,T002,41.95469,-87.800991,9,0,0,1,0,0,0,0
2,3,2008-06-11,CULEX PIPIENS,T002,41.95469,-87.800991,9,0,1,0,0,0,0,0
3,4,2008-06-11,CULEX SALINARIUS,T002,41.95469,-87.800991,9,0,0,0,1,0,0,0
4,5,2008-06-11,CULEX TERRITANS,T002,41.95469,-87.800991,9,0,0,0,0,0,1,0

In [176]:
test.info()

<class 'pandas.core.frame.DataFrame'>
Index: 116293 entries, 0 to 116292
Data columns (total 14 columns):
Id                   116293 non-null int64
Date                 116293 non-null datetime64[ns]
Species              116293 non-null object
Trap                 116293 non-null object
Lat                  116293 non-null float64
Long                 116293 non-null float64
AddressAccuracy      116293 non-null int64
ERR                  116293 non-null int64
PIP                  116293 non-null int64
REST                 116293 non-null int64
SAL                  116293 non-null int64
TARS                 116293 non-null int64
TERR                 116293 non-null int64
UNSPECIFIED CULEX    116293 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(9), object(2)
memory usage: 13.3+ MB

### Weather Data

In [204]:
weather.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2944 entries, 0 to 2943
Data columns (total 22 columns):
Station        2944 non-null int64
Date           2944 non-null object
Tmax           2944 non-null int64
Tmin           2944 non-null int64
Tavg           2944 non-null object
Depart         2944 non-null object
DewPoint       2944 non-null int64
WetBulb        2944 non-null object
Heat           2944 non-null object
Cool           2944 non-null object
Sunrise        2944 non-null object
Sunset         2944 non-null object
CodeSum        2944 non-null object
Depth          2944 non-null object
Water1         2944 non-null object
SnowFall       2944 non-null object
PrecipTotal    2944 non-null object
StnPressure    2944 non-null object
SeaLevel       2944 non-null object
ResultSpeed    2944 non-null float64
ResultDir      2944 non-null int64
AvgSpeed       2944 non-null object
dtypes: float64(1), int64(5), object(16)
memory usage: 506.1+ KB

In [205]:
def make_float(x):
    if x.isnumeric():
        return float(x)
    
    if x == 'M':
        return None
    
    return x

In [206]:
weather.Date = pd.to_datetime(weather.Date, infer_datetime_format=True)

columns_to_int = ['Station', 'Tmax', 'Tmin', 'Tavg', 'Depart', 'DewPoint', 'WetBulb', 'Heat', \
                  'Cool', 'Sunrise', 'Sunset', 'Depth', 'SnowFall', 'PrecipTotal', 'StnPressure', \
                  'SeaLevel', 'ResultSpeed', 'ResultDir', 'AvgSpeed']

weather.Water1 = weather.Water1.apply(lambda x : None if x == 'M' else x)

for col in columns_to_int:
    try:
        weather[col] = weather[col].astype('float')
    except:
        weather[col] = weather[col].apply(make_float)

In [209]:
rename_weather = {
    'Tmax': 'Temp_Max',
    'Tmin': 'Temp_Min',
    'Tavg': 'Temp_Avg',
    'Depart': 'Temp_Norm_Dev',
    'DewPoint': 'Temp_Dew_Point',
    'WetBulb': 'Temp_Wet_Bulb',
    'Depth': 'Max_Snow_Depth',
}

In [210]:
weather = weather.rename(index=str, columns=rename_weather)
weather.head()

,Station,Date,Temp_Max,Temp_Min,Temp_Avg,Temp_Norm_Dev,Temp_Dew_Point,Temp_Wet_Bulb,Heat,Cool,...,CodeSum,Max_Snow_Depth,Water1,SnowFall,PrecipTotal,StnPressure,SeaLevel,ResultSpeed,ResultDir,AvgSpeed
0,1.0,2007-05-01,83.0,50.0,67.0,14,51.0,56.0,0.0,2,...,,0.0,None,0.0,0.00,29.10,29.82,1.7,27.0,9.2
1,2.0,2007-05-01,84.0,52.0,68.0,None,51.0,57.0,0.0,3,...,,NaN,None,None,0.00,29.18,29.82,2.7,25.0,9.6
2,1.0,2007-05-02,59.0,42.0,51.0,-3,42.0,47.0,14.0,0,...,BR,0.0,None,0.0,0.00,29.38,30.09,13.0,4.0,13.4
3,2.0,2007-05-02,60.0,43.0,52.0,None,42.0,47.0,13.0,0,...,BR HZ,NaN,None,None,0.00,29.44,30.08,13.3,2.0,13.4
4,1.0,2007-05-03,66.0,46.0,56.0,2,40.0,48.0,9.0,0,...,,0.0,None,0.0,0.00,29.39,30.12,11.7,7.0,11.9

### Spray Data